example-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:book="http://www.cleverbuilder.com/BookService/">
   <soapenv:Header/>
   <soapenv:Body>
      <book:getAllBooks/>
   </soapenv:Body>
</soapenv:Envelope>